SELECT * FROM audit._leased_containers_open_and_closed_lease WHERE `Номер контейнера` ='NEPU4514550'

CREATE OR REPLACE TABLE audit._leased_containers_open_and_closed_lease
ENGINE = MergeTree()
ORDER BY tuple()
AS (

WITH
ZAYAVKI AS  (
SELECT
	`Тип заявки`,--`Изменено_`,`Создано_`,
	`Номер заявки`,`Дата заявки_`,`Тип аренды`,`Филиал привлечения`,`Собственник`,`Номер договора`,`Типоразмер`,`Заказано (шт)`,`Выдано (шт)`,`Кол-во льготных суток_`,`Ставка_`,`Валюта привлечения`,`Стоимость СНП_`,`Валюта стоимости СНП`,`Регион привлечения`,`Регион сдачи`--,`Последние изменения внёс`,`Описание (строка)`,`Тип контейнера`,file,sheet,source_row
FROM
	audit._zayavki_na_privlechenie
),
LEASED_CONTS AS ( 
SELECT
	`Исходник`,
	`Строка в исходнике`,
	`Номер контейнера`,
	`Заявка`,
	`Дата начала аренды`,
	`Собственник привлеченного контейнера`,
	--`Собственник привлеченного контейнера.1`,
	`Дата окончания аренды (факт)`,
	`Текущий срок пользования`,
	`Статус аренды`,
	`Тип размера`,
	`Собственник`,
	`Текущий сверхнормативный срок пользования`,
	`Тип аренды`,
	`Нормативный срок пользования`,
	`Дата окончания аренды (план)`,
	`Текущие ограничения`,
	`Номер Заказа`,`Станция отправления`,`Номер слота`,`Станция назначения`,`Станция дислокации`,`Менджер заказа`,
	`Регионы привлечения`,
	`Регионы сдачи`,`Последняя операция с контейнером`,`Дата последней операции`
FROM
	audit._leased_containers_open_lease -- SELECT `Исходник`, count() FROM audit._leased_containers_open_lease GROUP BY `Исходник` ORDER BY `Исходник`
UNION DISTINCT
SELECT
	`Исходник`,
	`Строка в исходнике`,
	`Номер контейнера`,
	`Заявка`,
	`Дата начала аренды`,
	`Собственник привлечённого контейнера`,
	`Дата окончания аренды (факт)`,
	`Текущий срок пользования`,
	NULL AS `Статус аренды`,
	`Тип размера`,
	`Собственник`,
	NULL AS `Текущий сверхнормативный срок пользования`,
	`Тип аренды`,
	NULL AS `Нормативный срок пользования`,
	NULL AS `Дата окончания аренды (план)`,
	`Текущие ограничения`,
	NULL AS `Номер Заказа`,NULL AS `Станция отправления`,NULL AS `Номер слота`,NULL AS `Станция назначения`,NULL AS `Станция дислокации`,NULL AS `Менджер заказа`,
	`Регионы привлечения`,
	NULL AS `Регионы сдачи`,NULL AS `Последняя операция с контейнером`,NULL AS `Дата последней операции`
FROM audit._leased_containers_closed_lease
WHERE `Дата окончания аренды (факт)`<>'' AND  `Дата начала аренды`<>`Дата окончания аренды (факт)`
),
LEASED_CONTS AS (
SELECT
	`Исходник`,`Строка в исходнике`,`Номер контейнера`,`Заявка`,
	`Дата начала аренды`,
	toDateOrNull(concat(
		substringUTF8(`Дата начала аренды`, 7, 4), '-',
		substringUTF8(`Дата начала аренды`, 4, 2), '-',
		substringUTF8(`Дата начала аренды`, 1, 2), ' ',
		substringUTF8(`Дата начала аренды`,	12, 8)
	)) AS `Дата начала аренды_`,
	`Собственник привлеченного контейнера`,
	`Дата окончания аренды (факт)`,
	toDateOrNull(concat(
		substringUTF8(`Дата окончания аренды (факт)`, 7, 4), '-',
		substringUTF8(`Дата окончания аренды (факт)`, 4, 2), '-',
		substringUTF8(`Дата окончания аренды (факт)`, 1, 2), ' ',
		substringUTF8(`Дата окончания аренды (факт)`, 12, 8)
	)) AS `Дата окончания аренды (факт)_`,
	`Текущий срок пользования`,`Статус аренды`,`Тип размера`,`Собственник`,`Текущий сверхнормативный срок пользования`,`Тип аренды`,`Нормативный срок пользования`,`Дата окончания аренды (план)`,`Текущие ограничения`,`Номер Заказа`,`Станция отправления`,`Номер слота`,`Станция назначения`,`Станция дислокации`,`Менджер заказа`,`Регионы привлечения`,`Регионы сдачи`,`Последняя операция с контейнером`,`Дата последней операции`
FROM
	LEASED_CONTS
--) SELECT * FROM LEASED_CONTS
),
LEASED_CONTS AS (
SELECT
	anyIf('Да', `Исходник` LIKE 'Закрытая%') OVER w AS `В закрытых`,
	anyIf('Да', `Исходник` LIKE 'Открытая%') OVER w AS `В открытых`,	
	`Исходник`,`Строка в исходнике`,`Номер контейнера`,`Заявка`,`Дата начала аренды`,`Дата начала аренды_`,`Собственник привлеченного контейнера`,`Дата окончания аренды (факт)`,`Дата окончания аренды (факт)_`,`Текущий срок пользования`,`Статус аренды`,`Тип размера`,`Собственник`,`Текущий сверхнормативный срок пользования`,`Тип аренды`,`Нормативный срок пользования`,`Дата окончания аренды (план)`,`Текущие ограничения`,`Номер Заказа`,`Станция отправления`,`Номер слота`,`Станция назначения`,`Станция дислокации`,`Менджер заказа`,`Регионы привлечения`,`Регионы сдачи`,`Последняя операция с контейнером`,`Дата последней операции`
FROM
	LEASED_CONTS
WINDOW
	w AS (PARTITION BY `Номер контейнера`, `Дата начала аренды_`)
)
SELECT
	*
FROM
	LEASED_CONTS 
	LEFT JOIN ZAYAVKI ON LEASED_CONTS.`Заявка`= ZAYAVKI.`Номер заявки`
WHERE NOT (`В закрытых`<>'' AND `В открытых`<>'' AND `Исходник` LIKE 'Открытая%')

)