WITH
SRC_TAB AS (
SELECT DISTINCT
	'TGBU5044820' AS contnumber, NOW() AS invdatedeparture
--FROM 
--	audit.rzhd_tarif_check_etran
--WHERE contnumber<>'' AND invdatedeparture IS NOT NULL
--) SELECT * FROM SRC_TAB
),
LEASED_CONTS AS (
SELECT
	*
FROM
	audit._leased_containers_open_and_closed_lease
),
LEASED_CONTS AS (
SELECT
    `Номер контейнера`, `Дата начала аренды_`,
    max(`Дата окончания аренды (факт)_`) AS `max_Дата окончания аренды (факт)_`,
    arrayStringConcat(
        groupArray(
            concat(
                '`Исходник`: '                                 , ifNull(toString(`Исходник`), ''), concat('; ', char(10)),
                '`Строка в исходнике`: '                       , ifNull(toString(`Строка в исходнике`), ''), concat('; ', char(10)),
                '`Заявка`: '                                   , ifNull(toString(`Заявка`), ''), concat('; ', char(10)),
                '`Дата начала аренды`: '                       , ifNull(toString(`Дата начала аренды`), ''), concat('; ', char(10)),
                '`Собственник привлеченного контейнера`: '     , ifNull(toString(`Собственник привлеченного контейнера`), ''), concat('; ', char(10)),
                '`Дата окончания аренды (факт)`: '             , ifNull(toString(`Дата окончания аренды (факт)`), ''), concat('; ', char(10)),
                '`Текущий срок пользования`: '                 , ifNull(toString(`Текущий срок пользования`), ''), concat('; ', char(10)),
                '`Статус аренды`: '                            , ifNull(toString(`Статус аренды`), ''), concat('; ', char(10)),
                '`Тип размера`: '                              , ifNull(toString(`Тип размера`), ''), concat('; ', char(10)),
                '`Собственник`: '                              , ifNull(toString(`Собственник`), ''), concat('; ', char(10)),
                '`Текущий сверхнормативный срок пользования`: ', ifNull(toString(`Текущий сверхнормативный срок пользования`), ''), concat('; ', char(10)),
                '`Тип аренды`: '                               , ifNull(toString(`Тип аренды`), ''), concat('; ', char(10)),
                '`Нормативный срок пользования`: '             , ifNull(toString(`Нормативный срок пользования`), ''), concat('; ', char(10)),
                '`Дата окончания аренды (план)`: '             , ifNull(toString(`Дата окончания аренды (план)`), ''), concat('; ', char(10)),
                '`Текущие ограничения`: '                      , ifNull(toString(`Текущие ограничения`), ''), concat('; ', char(10)),
                '`Номер Заказа`: '                             , ifNull(toString(`Номер Заказа`), ''), concat('; ', char(10)),
                '`Станция отправления`: '                      , ifNull(toString(`Станция отправления`), ''), concat('; ', char(10)),
                '`Номер слота`: '                              , ifNull(toString(`Номер слота`), ''), concat('; ', char(10)),
                '`Станция назначения`: '                       , ifNull(toString(`Станция назначения`), ''), concat('; ', char(10)),
                '`Станция дислокации`: '                       , ifNull(toString(`Станция дислокации`), ''), concat('; ', char(10)),
                '`Менджер заказа`: '                           , ifNull(toString(`Менджер заказа`), ''), concat('; ', char(10)),
                '`Регионы привлечения`: '                      , ifNull(toString(`Регионы привлечения`), ''), concat('; ', char(10)),
                '`Регионы сдачи`: '                            , ifNull(toString(`Регионы сдачи`), ''), concat('; ', char(10)),
                '`Последняя операция с контейнером`: '         , ifNull(toString(`Последняя операция с контейнером`), ''), concat('; ', char(10)),
                '`Дата последней операции`: '                  , ifNull(toString(`Дата последней операции`), ''), concat('; ', char(10))
            )
        ) AS `Номер контейнера_Дата начала аренды__array`,
        concat('==================================================', char(10))
    ) AS `**Номер контейнера_Дата начала аренды__info`,
    length(`Номер контейнера_Дата начала аренды__array`) AS `**Номер контейнера_Дата начала аренды__qty`
FROM
    LEASED_CONTS
GROUP BY
    `Номер контейнера`, `Дата начала аренды_`
--) SELECT * FROM LEASED_CONTS WHERE `Номер контейнера`='SSKU0000193'
),
LEASE_OPEN_BA AS (
SELECT
	contnumber,
	IF(argMaxIf(`Дата начала аренды_`, `Дата начала аренды_`, `Дата начала аренды_`<=invdatedeparture) AS A = toDateTime('1970-01-01 03:00:00'), NULL, A) AS `B_Дата начала аренды`,
	IF(argMaxIf(`max_Дата окончания аренды (факт)_`, `max_Дата окончания аренды (факт)_`, `max_Дата окончания аренды (факт)_`<=invdatedeparture) AS BB = toDateTime('1970-01-01 03:00:00'), NULL, BB) AS `B_Дата окончания аренды (факт)`,
	 invdatedeparture,
	IF(argMinIf(`Дата начала аренды_`, `Дата начала аренды_`, `Дата начала аренды_`>=invdatedeparture) AS C = toDateTime('1970-01-01 03:00:00'), NULL, C) AS `A_Дата начала аренды`,
	IF(argMinIf(`max_Дата окончания аренды (факт)_`, `max_Дата окончания аренды (факт)_`, `max_Дата окончания аренды (факт)_`>=invdatedeparture) AS AA = toDateTime('1970-01-01 03:00:00'), NULL, AA) AS  `A_Дата окончания аренды (факт)`
FROM
	LEASED_CONTS
	RIGHT JOIN SRC_TAB ON LEASED_CONTS.`Номер контейнера`=SRC_TAB.contnumber
GROUP BY 
	contnumber,invdatedeparture
--) SELECT * FROM LEASE_OPEN_BA --WHERE contnumber='SSKU0000193'
),
ANSWER AS (
SELECT
	contnumber,
	`B_Дата начала аренды`,`B_Дата окончания аренды (факт)`,
	date_diff(DAY, `B_Дата окончания аренды (факт)`, invdatedeparture) AS `B_окончание аренды day diff`,
	invdatedeparture,
	date_diff(DAY, invdatedeparture, `A_Дата начала аренды`) AS `A_начало аренды day diff`,	
	`A_Дата начала аренды`,`A_Дата окончания аренды (факт)`,
	replace(replace(replace(replace(arrayStringConcat(arraySort(
	arrayFilter(x->x.1 IS NOT NULL,
	[
		(invdatedeparture, 'invdatedeparture'),
		(`B_Дата начала аренды`, 'B_Дата начала аренды'),
		(`A_Дата начала аренды`, 'A_Дата начала аренды'),
		(`B_Дата окончания аренды (факт)`, 'B_Дата окончания аренды (факт)'),
		(`A_Дата окончания аренды (факт)`, 'A_Дата окончания аренды (факт)')
	])
	), concat('; ', char(10))), '.000', ''), '(''', ''),''')',''),''',''','\t') AS `События аренды`,
	multiIf(
		`B_Дата начала аренды` IS NULL AND `B_Дата окончания аренды (факт)` IS NULL AND `A_Дата начала аренды` IS NULL AND `A_Дата окончания аренды (факт)` IS NULL                                                       , 'не в аренде на дату и никогда не был',
		`B_Дата начала аренды` IS NULL AND `B_Дата окончания аренды (факт)` IS NULL AND `A_Дата начала аренды` IS NOT NULL AND `A_начало аренды day diff`<=7                                                              , 'в аренде, но не на дату, а в течение 7 дней после',
		`B_Дата начала аренды`<`B_Дата окончания аренды (факт)` AND `A_Дата начала аренды` IS NOT NULL AND `A_начало аренды day diff`<=7                                                                                  , 'в аренде, но не на дату, а в течение 7 дней после',		
		`B_Дата начала аренды` IS NULL AND `B_Дата окончания аренды (факт)` IS NULL AND `A_Дата начала аренды` IS NOT NULL AND `A_начало аренды day diff`>7                                                               , 'не в аренде на дату, но оказался в аренде позднее чем через 7 дней после',		
		`B_Дата начала аренды` IS NOT NULL AND `B_Дата окончания аренды (факт)` IS NULL AND `A_Дата начала аренды` IS NULL AND `A_Дата окончания аренды (факт)` IS NOT NULL                                               , 'в аренде на дату, аренда завершена',
		`B_Дата начала аренды` IS NOT NULL AND `B_Дата окончания аренды (факт)` IS NULL AND `A_Дата начала аренды` IS NULL AND `A_Дата окончания аренды (факт)` IS NULL                                                   , 'в аренде на дату, аренда не завершена',
		`B_Дата начала аренды` > `B_Дата окончания аренды (факт)` AND `A_Дата начала аренды` IS NULL AND `A_Дата окончания аренды (факт)` IS NOT NULL                                                                     , 'в аренде на дату (да и раньше бывал в аренде), аренда завершена',
		`B_Дата начала аренды` > `B_Дата окончания аренды (факт)` AND `A_Дата начала аренды` IS NULL AND `A_Дата окончания аренды (факт)` IS NULL                                                                         , 'в аренде на дату (да и раньше бывал в аренде), аренда не завершена',
		`B_Дата начала аренды` < `B_Дата окончания аренды (факт)` AND `A_Дата начала аренды`<`A_Дата окончания аренды (факт)` AND `B_окончание аренды day diff`>7 AND `A_начало аренды day diff`>7                        , 'не в аренде на дату, был ранее чем за 7 дней до и потом был в аренде, но позднее чем через 7 дней',			
		`B_Дата начала аренды` < `B_Дата окончания аренды (факт)` AND `A_Дата начала аренды` IS NOT NULL AND `A_Дата окончания аренды (факт)` IS NULL AND `B_окончание аренды day diff`>7 AND `A_начало аренды day diff`>7, 'не в аренде на дату, был ранее чем за 7 дней до и потом был в аренде, но позднее чем через 7 дней',
		`B_Дата начала аренды` < `B_Дата окончания аренды (факт)` AND `A_Дата начала аренды` IS NULL AND `A_Дата окончания аренды (факт)` IS NULL AND `B_окончание аренды day diff`>7                                     , 'не в аренде на дату, был ранее чем за 7 дней до, потом в аренде не был',
		`B_Дата начала аренды` IS NOT NULL AND `B_Дата окончания аренды (факт)` IS NULL AND `A_Дата начала аренды` > `A_Дата окончания аренды (факт)`                                                                     , 'в аренде на дату, аренда завершена, потом был снова арендован',	
		`B_Дата начала аренды` > `B_Дата окончания аренды (факт)` AND `A_Дата начала аренды` > `A_Дата окончания аренды (факт)`                                                                                           , 'в аренде на дату (да и раньше бывал в аренде), аренда завершена',
		`B_Дата начала аренды` < `B_Дата окончания аренды (факт)` AND `B_Дата окончания аренды (факт)`=invdatedeparture AND `A_Дата начала аренды` IS NULL AND `A_Дата окончания аренды (факт)`=invdatedeparture          , 'в аренде на дату, аренда завершена',
		`B_Дата начала аренды`=invdatedeparture AND `B_Дата окончания аренды (факт)` IS NULL AND `A_Дата начала аренды`=invdatedeparture AND `A_Дата окончания аренды (факт)`>`A_Дата начала аренды`		              , 'в аренде на дату, аренда завершена',
		`B_Дата начала аренды` < `B_Дата окончания аренды (факт)` AND `B_Дата окончания аренды (факт)`=invdatedeparture AND `A_Дата начала аренды`>`A_Дата окончания аренды (факт)` AND `A_Дата окончания аренды (факт)`=invdatedeparture, 'в аренде на дату, аренда завершена, потом был снова арендован',
		`B_Дата начала аренды` < `B_Дата окончания аренды (факт)` AND `B_окончание аренды day diff`<=7 AND `A_Дата начала аренды` IS NULL AND `A_Дата окончания аренды (факт)` IS NULL                                    , 'в аренде, но не на дату, а не позднее 7 дней ранее',
		`B_Дата начала аренды` > `B_Дата окончания аренды (факт)` AND `B_Дата начала аренды`=invdatedeparture AND `A_Дата окончания аренды (факт)`>`A_Дата начала аренды` AND `A_Дата начала аренды`=invdatedeparture     , 'в аренде на дату, аренда завершена, потом был снова арендован',		
		`B_Дата начала аренды` = `B_Дата окончания аренды (факт)` AND `A_Дата начала аренды` IS NULL AND `A_Дата окончания аренды (факт)` IS NULL                                                                         , 'невозможно определить',				
		''
	) AS `Контейнер в аренде на дату`
FROM
	LEASE_OPEN_BA
--) SELECT * FROM ANSWER --WHERE `Контейнер в аренде на дату`=''
)
SELECT
	contnumber,--`B_Дата начала аренды`,`B_Дата окончания аренды (факт)`,`B_окончание аренды day diff`,
	invdatedeparture,--`A_начало аренды day diff`,`A_Дата начала аренды`,`A_Дата окончания аренды (факт)`,
	`События аренды`,`Контейнер в аренде на дату`
FROM
	ANSWER