-- Загруженные даты
WITH
CAL AS (
SELECT YEAR(`Дата`) AS Y, MONTH(`Дата`) AS M, DAY(`Дата`) AS D FROM audit._calendar_2022_2027
--) SELECT * FROM CAL WHERE Y=2025
),
PISARENKO AS (
SELECT
	`Исходник`,`Строка в исходнике`,`Дата отправления`,`Дата прибытия`,`Номер вагона`,`Номер контейнера`,`Номер накладной`,`Футовость`,`Вид спецконтейнера`,`Груж-пор`,`Государство отправления`,`Государство назначения`,`Код станции отправления РФ`,`Название станции отправления РФ`,`Код станции назначения РФ`,`Название станции назначения РФ`,`Код станции отправления СНГ`,`Код станции назначения СНГ`,`Дорога отпр`,`Дорога наз`,`Вид перевозки`,`Код Груза ЕТСНГ`,`Название Груза ЕТСНГ`,`Группа груза`,`Код груза ГНГ`,`Грузоотправитель`,`ГрузоотправительГруппа`,`Грузополучатель`,`ГрузополучательГруппа`,`Плательщик`,`ПлательщикГруппа`,`Собственник`,`СобственникГруппа`,`Арендатор`,`АрендаторГруппа`,`Оператор`,`ОператорГруппа`,`КолВоКонт`,`ДФЭ`,`Вес груза`
FROM
	audit._pisarenko
--) SELECT * FROM PISARENKO
),
PISARENKO AS(
SELECT
YEAR(toDate(`Дата отправления`) AS d) AS Y,
MONTH(d) AS M,
DAY(d) AS D,
count() AS q
FROM audit._pisarenko_krytye
GROUP BY Y, M, D
--) SELECT * FROM PISARENKO 
)
SELECT 
	Y,M,D,q
FROM
	CAL
	LEFT JOIN PISARENKO USING Y, M, D
WHERE
	CAL.Y IN (2024, 2025, 2026) AND q=0
ORDER BY
	 Y, M, D

	 
	 
-- Загруженные отчеты	 
SELECT `Исходник`, count() AS q FROM audit._pisarenko_krytye  GROUP BY `Исходник` ORDER BY `Исходник`